{"backend": "tensorflow", "config": {"output_layers": [["loss", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "squeezenet", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 227, 227, 3], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "conv1", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [2, 2]}}, {"class_name": "Activation", "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "relu_conv1", "config": {"activation": "relu", "trainable": true, "name": "relu_conv1"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "name": "pool1", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "pool1", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool1", 0, 0, {}]]], "name": "fire2_squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire2_squeeze1x1", "filters": 16, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire2_squeeze1x1", 0, 0, {}]]], "name": "fire2_relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire2_relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2_relu_squeeze1x1", 0, 0, {}]]], "name": "fire2_expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire2_expand1x1", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2_relu_squeeze1x1", 0, 0, {}]]], "name": "fire2_expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire2_expand3x3", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire2_expand1x1", 0, 0, {}]]], "name": "fire2_relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire2_relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire2_expand3x3", 0, 0, {}]]], "name": "fire2_relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire2_relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire2_relu_expand1x1", 0, 0, {}], ["fire2_relu_expand3x3", 0, 0, {}]]], "name": "fire2_concat", "config": {"axis": 3, "trainable": true, "name": "fire2_concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2_concat", 0, 0, {}]]], "name": "fire3_squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire3_squeeze1x1", "filters": 16, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire3_squeeze1x1", 0, 0, {}]]], "name": "fire3_relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire3_relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire3_relu_squeeze1x1", 0, 0, {}]]], "name": "fire3_expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire3_expand1x1", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire3_relu_squeeze1x1", 0, 0, {}]]], "name": "fire3_expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire3_expand3x3", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire3_expand1x1", 0, 0, {}]]], "name": "fire3_relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire3_relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire3_expand3x3", 0, 0, {}]]], "name": "fire3_relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire3_relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire3_relu_expand1x1", 0, 0, {}], ["fire3_relu_expand3x3", 0, 0, {}]]], "name": "fire3_concat", "config": {"axis": 3, "trainable": true, "name": "fire3_concat"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["fire3_concat", 0, 0, {}]]], "name": "pool3", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "pool3", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool3", 0, 0, {}]]], "name": "fire4_squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire4_squeeze1x1", "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire4_squeeze1x1", 0, 0, {}]]], "name": "fire4_relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire4_relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4_relu_squeeze1x1", 0, 0, {}]]], "name": "fire4_expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire4_expand1x1", "filters": 128, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4_relu_squeeze1x1", 0, 0, {}]]], "name": "fire4_expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire4_expand3x3", "filters": 128, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire4_expand1x1", 0, 0, {}]]], "name": "fire4_relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire4_relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire4_expand3x3", 0, 0, {}]]], "name": "fire4_relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire4_relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire4_relu_expand1x1", 0, 0, {}], ["fire4_relu_expand3x3", 0, 0, {}]]], "name": "fire4_concat", "config": {"axis": 3, "trainable": true, "name": "fire4_concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4_concat", 0, 0, {}]]], "name": "fire5_squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire5_squeeze1x1", "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire5_squeeze1x1", 0, 0, {}]]], "name": "fire5_relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire5_relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire5_relu_squeeze1x1", 0, 0, {}]]], "name": "fire5_expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire5_expand1x1", "filters": 128, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire5_relu_squeeze1x1", 0, 0, {}]]], "name": "fire5_expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire5_expand3x3", "filters": 128, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire5_expand1x1", 0, 0, {}]]], "name": "fire5_relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire5_relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire5_expand3x3", 0, 0, {}]]], "name": "fire5_relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire5_relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire5_relu_expand1x1", 0, 0, {}], ["fire5_relu_expand3x3", 0, 0, {}]]], "name": "fire5_concat", "config": {"axis": 3, "trainable": true, "name": "fire5_concat"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["fire5_concat", 0, 0, {}]]], "name": "pool5", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "pool5", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool5", 0, 0, {}]]], "name": "fire6_squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire6_squeeze1x1", "filters": 48, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire6_squeeze1x1", 0, 0, {}]]], "name": "fire6_relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire6_relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6_relu_squeeze1x1", 0, 0, {}]]], "name": "fire6_expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire6_expand1x1", "filters": 192, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6_relu_squeeze1x1", 0, 0, {}]]], "name": "fire6_expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire6_expand3x3", "filters": 192, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire6_expand1x1", 0, 0, {}]]], "name": "fire6_relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire6_relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire6_expand3x3", 0, 0, {}]]], "name": "fire6_relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire6_relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire6_relu_expand1x1", 0, 0, {}], ["fire6_relu_expand3x3", 0, 0, {}]]], "name": "fire6_concat", "config": {"axis": 3, "trainable": true, "name": "fire6_concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6_concat", 0, 0, {}]]], "name": "fire7_squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire7_squeeze1x1", "filters": 48, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire7_squeeze1x1", 0, 0, {}]]], "name": "fire7_relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire7_relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire7_relu_squeeze1x1", 0, 0, {}]]], "name": "fire7_expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire7_expand1x1", "filters": 192, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire7_relu_squeeze1x1", 0, 0, {}]]], "name": "fire7_expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire7_expand3x3", "filters": 192, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire7_expand1x1", 0, 0, {}]]], "name": "fire7_relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire7_relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire7_expand3x3", 0, 0, {}]]], "name": "fire7_relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire7_relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire7_relu_expand1x1", 0, 0, {}], ["fire7_relu_expand3x3", 0, 0, {}]]], "name": "fire7_concat", "config": {"axis": 3, "trainable": true, "name": "fire7_concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire7_concat", 0, 0, {}]]], "name": "fire8_squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire8_squeeze1x1", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire8_squeeze1x1", 0, 0, {}]]], "name": "fire8_relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire8_relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire8_relu_squeeze1x1", 0, 0, {}]]], "name": "fire8_expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire8_expand1x1", "filters": 256, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire8_relu_squeeze1x1", 0, 0, {}]]], "name": "fire8_expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire8_expand3x3", "filters": 256, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire8_expand1x1", 0, 0, {}]]], "name": "fire8_relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire8_relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire8_expand3x3", 0, 0, {}]]], "name": "fire8_relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire8_relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire8_relu_expand1x1", 0, 0, {}], ["fire8_relu_expand3x3", 0, 0, {}]]], "name": "fire8_concat", "config": {"axis": 3, "trainable": true, "name": "fire8_concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire8_concat", 0, 0, {}]]], "name": "fire9_squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire9_squeeze1x1", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire9_squeeze1x1", 0, 0, {}]]], "name": "fire9_relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire9_relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire9_relu_squeeze1x1", 0, 0, {}]]], "name": "fire9_expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire9_expand1x1", "filters": 256, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire9_relu_squeeze1x1", 0, 0, {}]]], "name": "fire9_expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire9_expand3x3", "filters": 256, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire9_expand1x1", 0, 0, {}]]], "name": "fire9_relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire9_relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire9_expand3x3", 0, 0, {}]]], "name": "fire9_relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire9_relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire9_relu_expand1x1", 0, 0, {}], ["fire9_relu_expand3x3", 0, 0, {}]]], "name": "fire9_concat", "config": {"axis": 3, "trainable": true, "name": "fire9_concat"}}, {"class_name": "Dropout", "inbound_nodes": [[["fire9_concat", 0, 0, {}]]], "name": "drop9", "config": {"rate": 0.5, "trainable": true, "name": "drop9"}}, {"class_name": "Conv2D", "inbound_nodes": [[["drop9", 0, 0, {}]]], "name": "conv10-final", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "conv10-final", "filters": 4, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["conv10-final", 0, 0, {}]]], "name": "relu_conv10", "config": {"activation": "relu", "trainable": true, "name": "relu_conv10"}}, {"class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["relu_conv10", 0, 0, {}]]], "name": "global_average_pooling2d_1", "config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling2d_1"}}, {"class_name": "Activation", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "loss", "config": {"activation": "softmax", "trainable": true, "name": "loss"}}]}, "keras_version": "2.0.6", "class_name": "Model"}

